# CanAdjustEndLength Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..CanAdjustEndLength Method
FabricationPart Class See Also
---
Checks if the end of fabrication part can be adjusted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool CanAdjustEndLength(
	Connector connector
)
```

Visual Basic
---
```text
Public Function CanAdjustEndLength ( _
	connector As Connector _
) As Boolean
```

Visual C++
---
```text
public:
bool CanAdjustEndLength(
	Connector^ connector
)
```

# ### Parameters
connector
    Type: Autodesk.Revit.DB..::..Connector The connector of the fabrication part to adjust length.
# ### Return Value
True if the end of fabrication part can be adjusted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace